#Область ОбработчикиСобытийЭлементовТаблицыФормыСписок

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)

	HTMLТекущего = HTMLКомментарияНаСервере(Элемент.ТекущаяСтрока);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

//&НаСервере
//Функция HTMLКомментарияНаСервере(КомментарийСсылка)
//
//	Если НЕ ЗначениеЗаполнено(КомментарийСсылка) Тогда
//		Возврат "";
//	КонецЕсли;
//
//	ОбъектКомментария = КомментарийСсылка.ПолучитьОбъект();
//	Если ОбъектКомментария = Неопределено Тогда
//		Возврат "";
//	КонецЕсли;
//
//	Если НЕ ПустаяСтрока(ОбъектКомментария.ТекстHTML) Тогда
//		Возврат ОбъектКомментария.ТекстHTML;
//	КонецЕсли;
//
//	Возврат КТ_РазметкаСервер.HTMLКомментария(ОбъектКомментария.Текст, Неопределено);
//
//КонецФункции


&НаСервере
Функция HTMLКомментарияНаСервере(КомментарийСсылка)

    Если НЕ ЗначениеЗаполнено(КомментарийСсылка) Тогда
        Возврат "";
    КонецЕсли;

    Возврат КТ_РазметкаСервер.HTMLКомментарияДляПросмотра(КомментарийСсылка);

КонецФункции

#КонецОбласти
